sampleBlog3/app/controllers/comments_controller.rb

def edit
    @post = Post.find(params[:post_id])
	@comment = Comment.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 5]]

  def create
   @post = Post.find(params[:post_id])

   if @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("author", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Andy"], ["body", "Hello"], ["post_id", 3], ["created_at", "2016-02-18 07:29:28.878793"], ["updated_at", "2016-02-18 07:29:28.878793"]]

  def update
  @post = Post.find(params[:post_id])

  @comment = Comment.find(params[:id])
  @comment.update(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "retret"], ["updated_at", "2016-02-19 02:19:27.713767"], ["id", 12]]

 def destroy
    @post = Post.find(params[:post_id])

   @comment = Comment.find(params[:id])
  if @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]