sampleBlog3/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%use%')
---
  def index
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE (title LIKE '%project%')
---
  def search
	if params[:search]
   @posts = Post.search(params[:search])